app/controllers/card_controller.rb

  def new
    @card = Card.new
    @list = List.find_by(id: params[:list_id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @card = Card.new(card_params)
    if @card.save
---
INSERT INTO "cards" ("title", "memo", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "カード削除機能"], ["memo", "詳細を開いたときに削除リンクをクリックすると削除する。"], ["list_id", 3], ["created_at", "2020-03-15 12:35:27.972044"], ["updated_at", "2020-03-15 12:35:27.972044"]]

  def edit
    # 登録されているリスト一覧を取得し、プルダウンで表示する。
    @lists = List.where(user: current_user)
---
SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ?  [["user_id", 1]]

  def update
    if @card.update_attributes(card_params)
---
UPDATE "cards" SET "title" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["title", "Ruby入門"], ["updated_at", "2020-03-28 04:55:32.936594"], ["id", 4]]

  def destroy
    @card.destroy
---
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 8]]

    def set_card
      @card = Card.find_by(id: params[:id])
---
SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]