app/controllers/list_controller.rb

INSERT INTO "lists" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "かんばんをRailsで作成"], ["user_id", 1], ["created_at", "2020-03-14 07:19:10.605279"], ["updated_at", "2020-03-14 07:19:10.605279"]]
---
  def create
    @list = List.new(list_params)
    if @list.save

UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "tasklist_upd"], ["updated_at", "2020-03-14 14:36:10.938796"], ["id", 2]]
---
  def update
    if @list.update_attributes(list_params)

DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
---
  def destroy
    @list.destroy

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_list
      @list = List.find_by(id: params[:id])