app/controllers/top_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = ? ORDER BY created_at ASC  [["user_id", 1]]
---
  def index
    # ログインしている自分のリストを取得
    @lists = List.where(user: current_user).order("created_at ASC")