app/controllers/user_controller.rb

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "id" = ?, "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["id", nil], ["name", "shinzat安"], ["updated_at", "2020-03-14 14:28:29.186552"], ["id", 1]]

    def set_user
      @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]